In [1]:
import pandas as pd

In [2]:
# import pandas library
details = {
	0 : {
		'Name' : 'Hemanth',
		'Age' : 27,
		'University' : 'JNTU'
		},
	1 : {
		'Name' : 'Aishwarya',
		'Age' : 21,
		'University' : 'JNU'
		},
	2 : {
		'Name' : 'Shaurya',
		'Age' : 23,
		'University' : 'TU'
		},
 	3 : {
		'Name' : 'Hemanth Kumar',
		'Age' : 27,
		'University' : 'JNTU'
		},
}

# creating a Dataframe object
# from nested dictionary
# in which inside dictionary
# key is act as index value
# and column value is 0, 1, 2...
df = pd.DataFrame(details)

# swap the columns with indexes
df = df.transpose()
print(df)

            Name Age University
0        Hemanth  27       JNTU
1      Aishwarya  21        JNU
2        Shaurya  23         TU
3  Hemanth Kumar  27       JNTU

In [3]:
# Single selections using iloc and DataFrame
# Rows:
df.iloc[0] # first row of data frame

Name          Hemanth
Age                27
University       JNTU
Name: 0, dtype: object

In [4]:
df.iloc[:,0]

0          Hemanth
1        Aishwarya
2          Shaurya
3    Hemanth Kumar
Name: Name, dtype: object

In [5]:
df.iloc[:,-1]

0    JNTU
1     JNU
2      TU
3    JNTU
Name: University, dtype: object

In [6]:
df.iloc[:,-1].unique

<bound method Series.unique of 0    JNTU
1     JNU
2      TU
3    JNTU
Name: University, dtype: object>

In [7]:
df.iloc[:,-1]

0    JNTU
1     JNU
2      TU
3    JNTU
Name: University, dtype: object

In [8]:
df.loc[df['Name'] == 'Hemanth']

      Name Age University
0  Hemanth  27       JNTU

In [9]:

# importing modules
import pandas as pd
  
# creating a dataframe
df1 = pd.DataFrame({'Name':['Raju', 'Rani', 'Geeta', 'Sita', 'Sohit'],
                    'Marks':[80, 90, 75, 88, 59]})
  
# creating another dataframe with different data
df2 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita'],
                    'Grade':['A', 'A', 'B', 'A'],
                    'Rank':[3, 1, 4, 2 ],
                    'Gender':['Male', 'Female', 'Female', 'Female']})
# display df1
display(df1)
  
# display df2
display(df2)

    Name  Marks
0   Raju     80
1   Rani     90
2  Geeta     75
3   Sita     88
4  Sohit     59

    Name Grade  Rank  Gender
0   Raju     A     3    Male
1  Divya     A     1  Female
2  Geeta     B     4  Female
3   Sita     A     2  Female

In [10]:
# applying merge
df1.merge(df2[['Name', 'Grade', 'Rank']])

    Name  Marks Grade  Rank
0   Raju     80     A     3
1  Geeta     75     B     4
2   Sita     88     A     2

In [11]:
# importing modules
import pandas as pd

# creating a dataframe
df1 = pd.DataFrame({'Name':['Raju', 'Rani', 'Geeta', 'Sita', 'Sohit'],
					'Marks':[80, 90, 75, 88, 59]})

# creating another dataframe with different data
df2 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita'],
					'Grade':['A', 'A', 'B', 'A'],
					'Rank':[3, 1, 4, 2 ],
					'Gender':['Male', 'Female', 'Female', 'Female']})
# display df1
display(df1)

# display df2
display(df2)

# applying merge with more parameters
x = df1.merge(df2[['Grade', 'Name']], on = 'Name', how = 'left')

display(x)

    Name  Marks
0   Raju     80
1   Rani     90
2  Geeta     75
3   Sita     88
4  Sohit     59

    Name Grade  Rank  Gender
0   Raju     A     3    Male
1  Divya     A     1  Female
2  Geeta     B     4  Female
3   Sita     A     2  Female

    Name  Marks Grade
0   Raju     80     A
1   Rani     90   NaN
2  Geeta     75     B
3   Sita     88     A
4  Sohit     59   NaN

In [12]:
# applying merge with more parameters
x = df1.merge(df2[['Grade', 'Name']], on = 'Name', how = 'right')

display(x)

    Name  Marks Grade
0   Raju   80.0     A
1  Divya    NaN     A
2  Geeta   75.0     B
3   Sita   88.0     A

In [13]:
# applying merge with more parameters
x = df1.merge(df2[['Grade', 'Name']], on = 'Name', how = 'inner')

display(x)

    Name  Marks Grade
0   Raju     80     A
1  Geeta     75     B
2   Sita     88     A

In [16]:
# applying merge with more parameters
x = df1.merge(df2[['Grade', 'Name']], how = 'cross')

display(x)

   Name_x  Marks Grade Name_y
0    Raju     80     A   Raju
1    Raju     80     A  Divya
2    Raju     80     B  Geeta
3    Raju     80     A   Sita
4    Rani     90     A   Raju
5    Rani     90     A  Divya
6    Rani     90     B  Geeta
7    Rani     90     A   Sita
8   Geeta     75     A   Raju
9   Geeta     75     A  Divya
10  Geeta     75     B  Geeta
11  Geeta     75     A   Sita
12   Sita     88     A   Raju
13   Sita     88     A  Divya
14   Sita     88     B  Geeta
15   Sita     88     A   Sita
16  Sohit     59     A   Raju
17  Sohit     59     A  Divya
18  Sohit     59     B  Geeta
19  Sohit     59     A   Sita

In [17]:
# import pandas
import pandas as pd

# create data frame
Data = {'Name#': ['Mukul', 'Rohan', 'Mayank',
				'Shubham', 'Aakash'],
		
		'Location@' : ['Saharanpur', 'Meerut', 'Agra',
					'Saharanpur', 'Meerut'],
		
		'Pay&' : [25000,30000,35000,40000,45000]}

df=pd.DataFrame(Data)

# print original data frame
print(df)

# remove special character
df.columns=df.columns.str.replace('[#,@,&]','')

# print file after removing special character
print("\n\n" , df)

     Name#   Location@   Pay&
0    Mukul  Saharanpur  25000
1    Rohan      Meerut  30000
2   Mayank        Agra  35000
3  Shubham  Saharanpur  40000
4   Aakash      Meerut  45000


       Name    Location    Pay
0    Mukul  Saharanpur  25000
1    Rohan      Meerut  30000
2   Mayank        Agra  35000
3  Shubham  Saharanpur  40000
4   Aakash      Meerut  45000

<ipython-input-17-6412c3535158>:19: FutureWarning: The default value of regex will change from True to False in a future version.
  df.columns=df.columns.str.replace('[#,@,&]','')